snlkuharlocal/src/DataProcessors/ПечатьЭтикетокЧЗ_Многопоточная/ПечатьЭтикетокЧЗ_Многопоточная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьЭтикетокЧЗ_Многопоточная</name>
  <attributes>
    <name>ДокСсылка</name>
    <type>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменятьГС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КолКолонок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксЧислоЭтикеток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>фДублироватьЭтикетки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фНомерацияШтукПоДокументу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фСохранятьВPDF</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКодУпаковки</name>
  </attributes>
  <attributes>
    <name>фВыводитьЛогистическуюУпаковку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фПоОднойКоробке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фДублироватьКоробныеКоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокКМ</name>
    <attributes>
      <name>ШтрихКодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура_Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Модель_Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийМаркировки/ВидыОперацийМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийМаркировки</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>БронированиеАгрегационныхКодов</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки</name>
    <comment>Трансформация упаковки (Добавление, Изъятие)</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК</name>
    <comment>Трансформация АТК (Добавление, Изъятие)</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</name>
  <comment>Заказ на эмиссию кодов маркировки СУЗ</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_ЧЗ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ДокументаЧЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодовИзЧЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатурыЧЗВДокументе</name>
    <type>
      <types>EnumRef.ВидыНоменклатурыЧЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеНанесения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВводаВОборот</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗапланирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКомплекта</name>
    <type>
      <types>EnumRef.ВидыКомплектов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплект</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодовКомплект</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ГТИН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплект</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ПечатьЭтикетокЧЗ_Многопоточная/ObjectModule.bsl
Перем ОбработкаПечатиЭтикеток Экспорт;

Функция Печать(ДокОбъект, ДопПараметры = Неопределено) Экспорт	
	
	ДокСсылка = ДокОбъект.Ссылка;
	
	ПолучитьФорму("Форма").Открыть();

КонецФункции //Печать(ДокОбъект, ДопПараметры = Неопределено) Экспорт

Функция СформироватьЭтикету(Макет, Выборка, Знач ДопПараметры = Неопределено) Экспорт
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	КорректировкаРазмераШрифта = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "КорректировкаРазмераШрифта", 0);	
	
	Область 			= Макет.ПолучитьОбласть();	
	
	СтрокаКМ			= Справочники.ШтрихкодыУпаковокТоваров.ВосстановитьКод_GS1(Выборка.ЗначениеКМ); 
	ПоляШК 				= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьПоляШК_GS1(СтрокаКМ);	
	
	//ВывестиШК(Область, "ШК_ДатаМатрикс", СформироватьКартинкуШК_DataMatrix(Символ(232)+СтрокаКМ));
	ОбработкаПечатиЭтикеток.ВывестиШК(Область, "ШК_ДатаМатрикс", ОбработкаПечатиЭтикеток.СформироватьКартинкуШК_DataMatrix(СтрокаКМ));	
		
	ВыводитьЕАН13 = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ВыводитьЕАН13", Ложь);	
	
	Если ВыводитьЕАН13 Тогда
		Рис = Макет.Рисунки.ШК_ЕАН13;
		ОбработкаПечатиЭтикеток.ВывестиШК(Область, "ШК_ЕАН13", ОбработкаПечатиЭтикеток.СформироватьКартинкуШК_EAN(Прав(ПоляШК.ГТИН,13), Рис, КорректировкаРазмераШрифта));
	КонецЕсли; 
	
	Область.Параметры.Заполнить(Выборка);	
	Область.Параметры.Заполнить(ПоляШК);	
	Область.Параметры.Заполнить(ДопПараметры);	
	
	Возврат Область;
КонецФункции //СформироватьЭтикетку(СтрокаКМ)

Функция СформироватьКА(Макет, КодАгрегации, НомерКоробки, КоличествоШтук, Выборка, ДопПараметры = Неопределено) Экспорт	
	Если ДопПараметры = Неопределено Тогда
		Если ТипЗнч(Выборка) = Тип("Структура") Тогда
			ДопПараметры = Выборка;
		Иначе                      
			ДопПараметры = Новый Структура;
		КонецЕсли;			
	КонецЕсли;	
	
	ТипШК 		= МаркировкаКС.ПолучитьЗначениеПараметра(Выборка, "ТипШК", Перечисления.ТипыШтрихКодов.Коробка);
	НомерБлочка	= МаркировкаКС.ПолучитьЗначениеПараметра(Выборка, "НомерБлочка", 0);
	НомерПалеты	= МаркировкаКС.ПолучитьЗначениеПараметра(Выборка, "НомерПалеты", 0);
	
	БезПрефикса 				= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "БезПрефикса", Ложь);
	// Смирнов М.Ю. 01.08.2025 HELP-6117 начало
	//ДобавлятьСкобочкиВТекст 	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ДобавлятьСкобочкиВТекст", Ложь);
	ДобавлятьСкобочкиВТекст 	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ДобавлятьСкобочкиВТекст", Истина); 
	// Смирнов М.Ю. 01.08.2025 HELP-6117 конец
	
	ПрефиксШК = ?(БезПрефикса, "", "(00)");
	
	Область = Макет.ПолучитьОбласть();	
	
	Рис 	= Неопределено;
	Для Каждого Рис Из Область.Рисунки Цикл
		Если СтрНачинаетсяС(Рис.Имя, "ШК_SSCC") Тогда Прервать КонецЕсли;	
	КонецЦикла; 
	Если Рис = Неопределено Тогда
		Сообщить("В макете не найдено рисунка ШК_SSCC !", СтатусСообщения.Важное);
	КонецЕсли;
	
	Если КодАгрегации = "9999" Тогда		
		Область.Рисунки.Удалить(Рис);
		Область.Параметры.НеполнаяКоробка = "INCOMPLETE BOX";
	ИначеЕсли ЗначениеЗаполнено(КодАгрегации) Тогда
		Картинка = ОбработкаПечатиЭтикеток.СформироватьКартинкуШК_EAN(ПрефиксШК + КодАгрегации, Рис, ДопПараметры);
		ОбработкаПечатиЭтикеток.ВывестиШК(Область, Рис.Имя, Картинка);
	Иначе
		Область.Рисунки.Удалить(Рис);
		пОбласти = Новый Структура("НеполнаяКоробка", "NOT AGGREGATED");
		Область.Параметры.Заполнить(пОбласти);
	КонецЕсли;	
	
	пОбласти = Новый Структура("НомерБлочка,НомерКоробки,НомерПалеты,КоличествоШтук", НомерБлочка, НомерКоробки, НомерПалеты,КоличествоШтук);
	Если ДопПараметры.Свойство("Заголовок") Тогда
		пОбласти.Вставить("Заголовок", ДопПараметры.Заголовок);
	КонецЕсли;	
	ПрефиксКодаАгрегации = ?(ДобавлятьСкобочкиВТекст, "(00)", "");
	пОбласти.Вставить("ШтрихКод", ПрефиксКодаАгрегации + КодАгрегации);
	// Смирнов М.Ю. 01.08.2025 HELP-6117 начало
	пОбласти.Вставить("ШтрихКодКоробки", ПрефиксКодаАгрегации + КодАгрегации);
	// Смирнов М.Ю. 01.08.2025 HELP-6117 конец
	
	ЗаполнитьЗначенияСвойств(Область.Параметры, пОбласти);
	
	Область.Параметры.Заполнить(Выборка);	
	
	Возврат Область;
КонецФункции //СформироватьКА(Макет, КодАгрегации, НомерКоробки, КоличествоШтук, Выборка, ДопПараметры = Неопределено) Экспорт

// Кухарь А.Ю.  21.01.2025 начало
//  Функция СформироватьКА_БезНоменклатуры(Макет, КодАгрегации) Экспорт
Функция СформироватьКА_БезНоменклатуры(Макет, КодАгрегации, ДопПараметры=Неопределено) Экспорт 
	// Кухарь А.Ю.  21.01.2025 конец
	
	
	
	Область = Макет.ПолучитьОбласть("Коробка|Колонка");		
	Рис 	= Область.Рисунки.ШК_SSCC;	
	
	// Кухарь А.Ю.  21.01.2025 начало
	// Кухарь А.Ю.  24.01.2025 начало
	//По просьбе Алексея Петрова сделал для всех макетов
	//Префикс="00";
	Префикс="(00)";
	// Кухарь А.Ю.  24.01.2025 конец

	если ТипЗнч(ДопПараметры)=Тип("Структура") тогда
		//если ДопПараметры.свойство("ДобавлятьСкобки") тогда
		//	Если ДопПараметры.ДобавлятьСкобки тогда
		//		Префикс = "(00)";
		//	КонецЕсли;
		//КонецЕсли;
		// Кухарь А.Ю.  12.02.2025 начало
		// HELP-2858
		ДопПараметры.вставить("ШтрихКод",КодАгрегации);
		//ПрефиксКодаАгрегации="(00)";	
		//если  ДопПараметры.Свойство("АгрегацииВCode128") тогда
		//	если ДопПараметры.АгрегацииВCode128=Истина тогда
		//		ПрефиксКодаАгрегации="";		
		//	КонецЕсли;
		//КонецЕсли;
		//ДопПараметры.вставить("ШтрихКод",ПрефиксКодаАгрегации+КодАгрегации);		 
		// Кухарь А.Ю.  12.02.2025 конец

		область.параметры.заполнить(ДопПараметры);	
	КонецЕсли;
	// Кухарь А.Ю.  21.01.2025 конец
	
	// Кухарь А.Ю.  21.01.2025 начало
	// Картинка = СформироватьКартинкуШК_EAN("00"+КодАгрегации, Рис);	
	Картинка = ОбработкаПечатиЭтикеток.СформироватьКартинкуШК_EAN(Префикс+КодАгрегации, Рис, ДопПараметры);	 
	// Кухарь А.Ю.  21.01.2025 конец
	
	ОбработкаПечатиЭтикеток.ВывестиШК(Область, "ШК_SSCC", Картинка);
	
	Возврат Область;
КонецФункции //СформироватьКА(Макет, КодАгрегации, НомерКороба, КоличествоШтук, Выборка, УголПоворота = 0)

Функция ПечатьКодовАгрегаций(КодыАгрегаций, ИмяМакета, фСохранятьВPDF, АгрегацииВCode128 = Ложь) Экспорт	
	Части = СтрРазделить(ИмяМакета,"_");
	
	ШиринаСтраницы = Число(Части[0]);
	ВысотаСтраницы = Число(Части[1]);
	
	ТД = Новый ТабличныйДокумент;
	Если НЕ фСохранятьВPDF Тогда
		ТД.ИмяПараметровПечати	= "ПараметрыПечати_Этикетки_DataMatrix" + ИмяМакета;					
	КонецЕсли;
	
	ТД.ПолеСверху	= 0.0;
	ТД.ПолеСнизу 	= 0.0;
	ТД.ПолеСправа 	= 0.0;
	ТД.ПолеСлева 	= 0.0;
	
	ТД.ШиринаСтраницы = ШиринаСтраницы;
	ТД.ВысотаСтраницы = ВысотаСтраницы;
	
	Макет	= ПолучитьМакет("Этикетка_" + ИмяМакета);
	
	ВсегоСтрок = КодыАгрегаций.Количество();
	Сч = 0;
	
	// Кухарь А.Ю.  21.01.2025 начало
	//
	ДопПараметры=новый Структура();
	если СтрНайти(ИмяМакета,"45_30")> 0 тогда
		ДопПараметры.Вставить("ДобавлятьСкобки",Истина);
		ДопПараметры.Вставить("ОтображатьТекст",ложь);
	КонецЕсли;
	// Кухарь А.Ю.  21.01.2025 конец
	
	// Кухарь А.Ю.  29.01.2025 начало
	если СтрНайти(ИмяМакета,"25_25")> 0  тогда
		ДопПараметры.Вставить("ДобавлятьСкобки",Истина);
		ДопПараметры.Вставить("ОтображатьТекст",ложь);
	КонецЕсли;
	// Кухарь А.Ю.  29.01.2025 конец
	
	//Валетов + 07,02,25 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1355
	Если СтрНайти(ИмяМакета,"100_50")> 0 ИЛИ АгрегацииВCode128 Тогда
		ДопПараметры.Вставить("ДобавлятьСкобки",Истина);
		ДопПараметры.Вставить("ОтображатьТекст",Истина);
		ДопПараметры.Вставить("АгрегацииВCode128",АгрегацииВCode128);
	КонецЕсли;
	
	Для Каждого КодАгрегации Из КодыАгрегаций Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ
		
		// Кухарь А.Ю.  21.01.2025 начало
		//ТД.Вывести(СформироватьКА_БезНоменклатуры(Макет, КодАгрегации));
		ТД.Вывести(СформироватьКА_БезНоменклатуры(Макет, КодАгрегации,ДопПараметры));	 
		// Кухарь А.Ю.  21.01.2025 конец
		
		Если фСохранятьВPDF Тогда
			ТД.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		
		Сч = Сч + 1;
		МаркировкаКС.Состояние_("Вывод: " + (ВсегоСтрок - Сч));
	КонецЦикла; 	
	МаркировкаКС.Состояние_("");
	
	Возврат ТД;
КонецФункции //ПечатьКодовКоробок(СписокКодов, ИмяМакета, фСохранятьВPDF)

Функция ПечатьЭтикетокПоЗПС(ЗПС_Ссылка, ИмяМакета, пОбработки = Неопределено, АдресВозврата = Неопределено) Экспорт
	фВыводитьЛогистическуюУпаковку 	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "фВыводитьЛогистическуюУпаковку", Ложь);
	МаксЧислоЭтикеток				= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "МаксЧислоЭтикеток", 0);
	
	Запрос			= Новый Запрос;
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование КАК ЗПС,
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка КАК Эмиссия
	|ПОМЕСТИТЬ ВТ_Эмиссии
	|ИЗ
	|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|ГДЕ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование = &ЗПС_Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КодыАгрегации.КодАгрегации, ""9999"") КАК КодАгрегации,
	|	ШК_ЧЗ.Владелец.Родитель КАК Модель,
	|	ШК_ЧЗ.Владелец.Родитель.ШтукВКоробке КАК ШтукВКоробке,
	|	ШК_ЧЗ.Владелец.Родитель.КодПроизводителя КАК Артикул,
	|	ШК_ЧЗ.Владелец.Цвет КАК Цвет,
	|	ШК_ЧЗ.Владелец.Размер.Наименование + "" "" + ЕСТЬNULL(ШК_ЧЗ.Владелец.ДопПараметрРазмера.Наименование, """") КАК Размер,
	|	ШК_ЧЗ.Владелец КАК Номенклатура,
	|	ШК_ЧЗ.Владелец.Код КАК Номенклатура_Код,
	|	ШК_ЧЗ.Владелец.ГТИН КАК Номенклатура_ГТИН,
	|	ШК_ЧЗ.Ссылка КАК КМ,
	|	ШК_ЧЗ.Ссылка.Наименование КАК СГТИН,
	|	ШК_ЧЗ.ЗначениеШтрихкода КАК ЗначениеКМ
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШК_ЧЗ
	|		ПРАВОЕ СОЕДИНЕНИЕ ВТ_Эмиссии КАК ВТ_Эмиссии
	|		ПО ШК_ЧЗ.ЗаказКМ = ВТ_Эмиссии.Эмиссия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК КодыАгрегации
	|		ПО ШК_ЧЗ.Ссылка = КодыАгрегации.ШтрихкодУпаковки
	|			И (КодыАгрегации.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация))
	|			И (КодыАгрегации.Ссылка.ДокументОснование = &ЗПС_Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодАгрегации,
	|	ШК_ЧЗ.Владелец,
	|	ШК_ЧЗ.Наименование
	|ИТОГИ
	|	МАКСИМУМ(Артикул),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КМ)
	|ПО
	|	Номенклатура,
	|	КодАгрегации";
	
	Запрос.УстановитьПараметр("ЗПС_Ссылка", ЗПС_Ссылка);	
	
	ВсегоКоробов= 0;
	КолКМ		= 0;
	
	Макет	= ПолучитьМакет("Этикетка_" + ИмяМакета);
	
	// Кухарь А.Ю. 22.04.2024 начало	
	Если фНомерацияШтукПоДокументу тогда
		Запрос2=новый запрос;
		Запрос2.Текст="ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &ЗПС_Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщикуТовары.Номенклатура";
		запрос2.УстановитьПараметр("ЗПС_Ссылка",ЗПС_Ссылка);
		ТЗТовары=Запрос2.Выполнить().Выгрузить();
	КонецЕсли;
	
	
	ВыводитьЕАН13 = Ложь;					
	ОблСтрока = Макет.ПолучитьОбласть("Товар|Колонка");
	Для Каждого Рисунок Из ОблСтрока.Рисунки Цикл
		Если Рисунок.Имя = "ШК_ЕАН13" Тогда
			ВыводитьЕАН13 = Истина;
		КонецЕсли;	
	КонецЦикла; 
	
	Части = СтрРазделить(ИмяМакета,"_");
	
	ШиринаСтраницы = Число(Части[0]);
	ВысотаСтраницы = Число(Части[1]);
	
	рЗапроса = Запрос.Выполнить();	
	
	Выборка_Номенклатура = рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");	
	Пока Выборка_Номенклатура.Следующий() Цикл
		Выборка_КодАгрегации 	= Выборка_Номенклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "КодАгрегации");
		ВсегоКоробов			= ВсегоКоробов + Выборка_КодАгрегации.Количество();
		
		Пока Выборка_КодАгрегации.Следующий() Цикл			
			
			Если Выборка_КодАгрегации.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
				КолКМ = КолКМ + Выборка_КодАгрегации.КМ;					
				//Сообщить(""+Выборка_КодАгрегации.КодАгрегации+" "+Выборка_КодАгрегации.КМ+" "+КолКМ);			
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;		
		
	Сч = 0;	
	НомерКоробки 		= 0;
	КоличествоФайлов 	= 0;
	
	Выборка_Номенклатура.Сбросить();	
	
	Пока Выборка_Номенклатура.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка_Номенклатура.КМ) Тогда Продолжить КонецЕсли;		
		
		// Кухарь А.Ю. 22.04.2024 начало		
		ШтукВНакладной=0;
		СчКоличестваПоНакладной=0;
		Если фНомерацияШтукПоДокументу тогда
			СтрТЗ=ТЗТовары.Найти(Выборка_Номенклатура.Номенклатура,"Номенклатура");
			если СтрТЗ<>Неопределено тогда
				ШтукВНакладной=СтрТЗ.Количество;
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю. 22.04.2024 конец
		
		ТД_Результат = Новый ТабличныйДокумент;
			
		ТД_Результат.ПолеСверху	= 0.0;
		ТД_Результат.ПолеСнизу 	= 0.0;
		ТД_Результат.ПолеСправа = 0.0;
		ТД_Результат.ПолеСлева 	= 0.0;
		
		ТД_Результат.ШиринаСтраницы = ШиринаСтраницы;
		ТД_Результат.ВысотаСтраницы = ВысотаСтраницы;		
		
		ШтукВКоробке 			= Выборка_Номенклатура.ШтукВКоробке;
		
		Выборка_КодАгрегации 	= Выборка_Номенклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "КодАгрегации");
		
		НомерКоробки			= 0;
		ВсегоКоробокПоМодели	= Выборка_КодАгрегации.Количество();
		
		Пока Выборка_КодАгрегации.Следующий() Цикл
			КодАгрегации = Выборка_КодАгрегации.КодАгрегации;			
			
			Если НЕ ЗначениеЗаполнено(КодАгрегации) Тогда Продолжить КонецЕсли;
			
			НомерКоробки = НомерКоробки + 1;		
			МаркировкаКС.Состояние_("Вывод: "+Выборка_Номенклатура.Артикул+"кор.: "+НомерКоробки+" из "+ВсегоКоробокПоМодели);			
			
			Если НЕ фСохранятьВPDF Тогда			
				ТД_Результат.ИмяПараметровПечати	= "ПараметрыПечати_Этикетки_DataMatrix"+ИмяМакета;			
			КонецЕсли; 
			
			ТД_Результат.ОтображатьСетку		= Ложь;
			ТД_Результат.ОтображатьЗаголовки	= Ложь;
			
			КоличествоШтук	= 0;			
			Выборка			= Выборка_КодАгрегации.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				МаркировкаКС.ОбработкаПрерыванияПользователя_();
				
				Сч 				= Сч+1;		
				КоличествоШтук	= КоличествоШтук + 1;				
				
				// Кухарь А.Ю. 22.04.2024 начало				
				СчКоличестваПоНакладной=СчКоличестваПоНакладной+1;     
				Если фНомерацияШтукПоДокументу тогда
					ДопПараметры	= Новый Структура("НомерКоробки,ВсегоКоробок,НомерШтуки,ШтукВКоробке,ВыводитьЕАН13", 
						НомерКоробки, ВсегоКоробокПоМодели, СчКоличестваПоНакладной, ШтукВНакладной, ВыводитьЕАН13);	
				иначе
					ДопПараметры	= Новый Структура("НомерКоробки,ВсегоКоробок,НомерШтуки,ШтукВКоробке,ВыводитьЕАН13", 
						НомерКоробки, ВсегоКоробокПоМодели, КоличествоШтук, ШтукВКоробке, ВыводитьЕАН13);	
				КонецЕсли; 
				// Кухарь А.Ю. 22.04.2024 конец			
				
				Этикета 		= СформироватьЭтикету(Макет, Выборка, ДопПараметры);				
				
				Если КолКолонок = 0 ИЛИ КоличествоШтук % КолКолонок = 1 Тогда
					ТД_Результат.Вывести(Этикета);
					Если КолКолонок = 0 И фСохранятьВPDF Тогда
						ТД_Результат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					Если фДублироватьЭтикетки Тогда
						ТД_Результат.Вывести(Этикета);
						Если КолКолонок = 0 И фСохранятьВPDF Тогда
							ТД_Результат.ВывестиГоризонтальныйРазделительСтраниц();
						КонецЕсли;				
					КонецЕсли; 
				Иначе					
					ТД_Результат.Присоединить(Этикета);					
				КонецЕсли;
				
				Если МаксЧислоЭтикеток>0 И КоличествоШтук >= МаксЧислоЭтикеток Тогда
					Прервать;				
				КонецЕсли; 
				
				Если Сч%10 = 0 Тогда
					МаркировкаКС.Состояние_("" + КолКМ - Сч);			
				КонецЕсли;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(КодАгрегации) И фВыводитьЛогистическуюУпаковку Тогда					

				КА = СформироватьКА(Макет, КодАгрегации, НомерКоробки, КоличествоШтук, Выборка_Номенклатура);				
				
				ВременныйТаблДок = Новый ТабличныйДокумент;
   				ОбластьЯчеек = ВременныйТаблДок.Вывести(КА);   				
       			ОбластьЯчеек.СоздатьФорматСтрок();    				
				
				ТД_Результат.Вывести(ВременныйТаблДок);
				
			КонецЕсли;			
			
			МаркировкаКС.ОбработкаПрерыванияПользователя_();
			
			Если МаксЧислоЭтикеток > 0 И КоличествоШтук >= МаксЧислоЭтикеток Тогда Прервать КонецЕсли;
		КонецЦикла;
		
		Если фСохранятьВPDF Тогда			
			//реквЗПС		= ПолучитьРеквизитыШапки(ЗПС_Ссылка, "Номер,Дата");
			ИмяФайла = СформироватьИмяФайла(Выборка_Номенклатура.Артикул, Выборка_Номенклатура.Цвет, Выборка_Номенклатура.Размер, ИмяМакета, "pdf");
			
			Сообщить("Запись файла: "+ ИмяФайла+"...");
			
			ТД_Результат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
			
			МаркировкаКС.Состояние_("");
			
			КоличествоФайлов = КоличествоФайлов + 1;
		Иначе
			ТД_Результат.Показать(Выборка_КодАгрегации.КодАгрегации);
		КонецЕсли;			
		
		Если МаксЧислоЭтикеток>0 И КоличествоШтук >= МаксЧислоЭтикеток Тогда Прервать КонецЕсли;
	КонецЦикла; 
	
	Сообщить("Обработка завершена ! Записано: "+КоличествоФайлов+" файлов, распечатано: "+Сч+" кодов товаров.");	

КонецФункции //ПечатьЭтикетокПоЗПС(ЗПС_Ссылка, ИмяМакета)

Функция СформироватьИмяФайла(Знач Артикул, Знач Цвет, Знач Размер, Макет, Расширение) Экспорт
	Артикул	= УдалитьМусорИзСтроки(Артикул);
	Цвет	= УдалитьМусорИзСтроки(Цвет);
	Размер	= УдалитьМусорИзСтроки(Размер);	
	
	Шаблон = "%1_%2_%3";
	Если ЗначениеЗаполнено(Макет) Тогда
		Шаблон		= Шаблон + "_%4."+Расширение;
		ИмяФайла	= СтрШаблон(Шаблон, Артикул, Цвет, Размер, Макет);
	Иначе		
		Шаблон 		= Шаблон + "."+Расширение;
		ИмяФайла	= СтрШаблон(Шаблон, Артикул, Цвет, Размер);
	КонецЕсли;
	
	Возврат ПолноеИмяФайла(КаталогВыгрузки, ИмяФайла);
КонецФункции //СформироватьИмяФайла(Знач Артикул, Знач Цвет, Знач Размер, Макет, Расширение)

Функция УдалитьМусорИзСтроки(Знач ВходСтрока)
	Результат = СокрЛП(""+ВходСтрока);
	
	Результат = СтрЗаменить(Результат, "/", 	"");
	Результат = СтрЗаменить(Результат, "\", 	"");
	Результат = СтрЗаменить(Результат, ":", 	"");
	Результат = СтрЗаменить(Результат, ";", 	"_");
	Результат = СтрЗаменить(Результат, """",	"");
	Результат = СтрЗаменить(Результат, "'", 	"");	
	Результат = СтрЗаменить(Результат, "<", 	"");
	Результат = СтрЗаменить(Результат, ">", 	"");
	Результат = СтрЗаменить(Результат, "|", 	"");
	Результат = СтрЗаменить(Результат, "?", 	"");
	Результат = СтрЗаменить(Результат, "*", 	"");
	
	Возврат СокрЛП(Результат);
КонецФункции //УдалитьМусорИзСтроки(Знач ВходСтрока) 

Функция ПолноеИмяФайла(ИмяКаталога, ИмяФайла) Экспорт
	мКаталогВыгрузки = СокрЛП(КаталогВыгрузки);
	РП = ПолучитьРазделительПутиКлиента();
	Если НЕ СтрЗаканчиваетсяНа(мКаталогВыгрузки, РП) Тогда
		мКаталогВыгрузки = мКаталогВыгрузки + РП;	
	КонецЕсли;
	
	Возврат мКаталогВыгрузки + ИмяФайла;
КонецФункции //ПолноеИмяФайла(ИмяКаталога, ИмяФайла)

#Область МногопоточноеФормированиеЭтикеток


Функция ПакетнаяПечатьЭтикетокЧЗ(пОбработки, АдресВозврата = Неопределено) Экспорт	
	Результат 		= МаркировкаКС.СтруктураРезультата(Ложь);	
	
	пВыполненияВФоне = инт_ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);	
	пВыполненияВФоне.Вставить("ЗапуститьНеВФоне", Ложь);
	
	ВнешнийОтчетОбработка = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ВнешнийОтчетОбработка");
	Если ЗначениеЗаполнено(ВнешнийОтчетОбработка) Тогда	
		пВыполненияВФоне.Вставить("ВнешнийОтчетОбработка", ВнешнийОтчетОбработка);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, пОбработки);
	
	ЗПС_Ссылка				= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ЗаказПоставщику");	
	ИмяМакета 				= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ИмяМакета");
	ДопПараметрыЭтикетки	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ДопПараметрыЭтикетки");	
	
	ТекКаталогВыгрузки		= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "КаталогВыгрузки");	
	МаксЧислоЭтикеток		= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "МаксЧислоЭтикеток", 0);
	
	Если ПустаяСтрока(ТекКаталогВыгрузки) Тогда
		Результат.Ошибки.Добавить("Не указан каталог выгрузки !");
	Иначе
		Файл = Новый Файл(ТекКаталогВыгрузки);
		Если Файл.Существует() Тогда
			Если НЕ Файл.ЭтоКаталог() Тогда        
				ТекстОшибки = СтрШаблон("Указанный каталог выгрузки: '%1' не являается каталогом !", СокрЛП(ТекКаталогВыгрузки));
				Результат.Ошибки.Добавить(ТекстОшибки);										
			КонецЕсли;
		Иначе                                                         
			ТекстОшибки = СтрШаблон("Указанный каталог выгрузки: '%1' не найден!", СокрЛП(ТекКаталогВыгрузки));
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Если Результат.Ошибки.Количество() > 0 Тогда
		Возврат Результат;	
	КонецЕсли;
	
	ТекКаталогВыгрузки = СокрЛП(ТекКаталогВыгрузки);
	Если НЕ СтрЗаканчиваетсяНа(ТекКаталогВыгрузки, ПолучитьРазделительПути()) Тогда
		ТекКаталогВыгрузки  = ТекКаталогВыгрузки + ПолучитьРазделительПути();
	КонецЕсли;
	
	ТекКаталогВыгрузки = ТекКаталогВыгрузки + ЗПС_Ссылка.Номер + ПолучитьРазделительПути();	
	ПроверитьСоздатьКаталогФайлов(ТекКаталогВыгрузки);			
	УдалитьФайлы(ТекКаталогВыгрузки, "*.*");

	Сообщить("Получение полей для макета: "+ИмяМакета);	
	
	мНоменклатура 		= ПолучитьНоменклатуруДокумента(ЗПС_Ссылка);
	
	ДлительныеОперации.СообщитьПрогресс(, "Формирование макетов этикеток...");
	
	// Смирнов М.Ю. 28.07.2025 HELP-6117 начало
	//рПолученияМакетов 	= ОбработкаПечатиЭтикеток.ПолучитьМакетыЭтикеток(Новый Структура("ИмяМакета,Номенклатура,ДокОснование,ДопПараметры", ИмяМакета, мНоменклатура, ЗПС_Ссылка, ДопПараметрыЭтикетки));
	ПараметрыПолученияМакетыЭтикеток = Новый Структура("ИмяМакета,Номенклатура,ДокОснование,ДопПараметры,Импортер,ДатаВыпуска", 
		ИмяМакета, мНоменклатура, ЗПС_Ссылка, ДопПараметрыЭтикетки, пОбработки.Импортер, пОбработки.ДатаВыпуска);
	рПолученияМакетов 	= ОбработкаПечатиЭтикеток.ПолучитьМакетыЭтикеток(ПараметрыПолученияМакетыЭтикеток);
	// Смирнов М.Ю. 28.07.2025 HELP-6117 конец
	
	Если рПолученияМакетов.Успешно Тогда
		СписокМакетов		= рПолученияМакетов.Данные;
	Иначе                                              
		Возврат рПолученияМакетов;		
	КонецЕсли;	
	
	ВыведеноЭтикетокВсего = 0;
	
	АктивныеФЗ	= Новый Массив;
	МаксЧислоФЗ	= 10;
		
	Выборка_Номенклатура = ПолучитьВыборкуКодов(ЗПС_Ссылка, МаксЧислоЭтикеток);
	
	ВсегоЭтикеток = 0;
	Пока Выборка_Номенклатура.Следующий() Цикл
		ВсегоЭтикеток = ВсегоЭтикеток+Выборка_Номенклатура.КМ;	
	КонецЦикла;              
	Выборка_Номенклатура.Сбросить();
	
	Пока Выборка_Номенклатура.Следующий() Цикл
		ТекстСообщения = СтрШаблон("Формирование этикеток по ном.: %1 (%2). Сформировано: %3 из %4", 
			Выборка_Номенклатура.Номенклатура_Наименование, Выборка_Номенклатура.Номенклатура_Код, ВыведеноЭтикетокВсего, ВсегоЭтикеток);
		ДлительныеОперации.СообщитьПрогресс(Формат(100*ВыведеноЭтикетокВсего/ВсегоЭтикеток, "ЧДЦ=2"), ТекстСообщения);
		
		ИмяПапки = СформироватьИмяПапкиНоменклатуры(Выборка_Номенклатура.Номенклатура_НаименованиеGS1, Выборка_Номенклатура.Номенклатура_Наименование, Выборка_Номенклатура.Номенклатура_Код);		
		Если ПустаяСтрока(ИмяПапки) Тогда
			Продолжить;
		Иначе   
			Макеты				= СписокМакетов[Выборка_Номенклатура.Номенклатура];
			
			КаталогВыгрузкиНом	= ТекКаталогВыгрузки + ИмяПапки;
			ПроверитьСоздатьКаталогФайлов(КаталогВыгрузкиНом);			
			УдалитьФайлы(КаталогВыгрузкиНом, "*.*");
			
			//ВыгрузитьШаблоныМакетов(Макеты, ИмяМакета, КаталогВыгрузкиНом, пОбработки);			
			
			ШтукВКоробке	= Выборка_Номенклатура.ШтукВКоробке;
			НомерКоробки	= 0;
			
			Если фПоОднойКоробке Тогда
				РазмерПорции = ШтукВКоробке;
			Иначе
				РазмерПорции = ОпределитьРазмерПорции(ШтукВКоробке);			
			КонецЕсли;                               
			КоробокВФайле = РазмерПорции / ШтукВКоробке;
			
			НомерПорции		= 0;
			
			ДопПараметры 	= Новый Структура();			
			
			ВыведеноЭтикетокПоНом = 0;
			ДанныеКоробок	= Новый Массив;
			Выборка_КА 		= Выборка_Номенклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "КодАгрегации");
			ВсегоКоробок	= Выборка_КА.Количество();
			
			ДанныеДляПечати = Новый Структура("Номенклатура,ДопПараметры", Выборка_Номенклатура.Номенклатура, ДопПараметры);
			
			// Смирнов М.Ю. 01.08.2025 HELP-6117 начало
			ДопПараметры.Вставить("ИмяМакета", ИмяМакета);
			// Смирнов М.Ю. 01.08.2025 HELP-6117 конец
			
			ВсегоКМпоНом	= Выборка_Номенклатура.КМ;
			
			Пока Выборка_КА.Следующий() Цикл				
				Выборка 			= Выборка_КА.Выбрать();				
				НомерКоробки		= НомерКоробки + 1;
				
				МассивКМ			= Новый Массив;
				Пока Выборка.Следующий() Цикл
					МаркировкаКС.ОбработкаПрерыванияПользователя_();
					
					ДанныеКМ = Новый Структура("КМ,СГТИН,ЗначениеКМ");
					ЗаполнитьЗначенияСвойств(ДанныеКМ, Выборка);
					
					МассивКМ.Добавить(ДанныеКМ);					
					
					ВыведеноЭтикетокВсего	= ВыведеноЭтикетокВсего + 1;
					ВыведеноЭтикетокПоНом	= ВыведеноЭтикетокПоНом + 1;
					
					Если (МаксЧислоЭтикеток > 0 И ВыведеноЭтикетокВсего >= МаксЧислоЭтикеток) Тогда Прервать КонецЕсли;
				КонецЦикла;				
				
				ДанныеКоробок.Добавить(Новый Структура("Модель, Цвет, Размер, ШтукВКоробке, НомерКоробки, НомерКороба, ВсегоКоробок, КодАгрегации, МассивКМ", 
					Выборка_Номенклатура.Модель, Выборка_Номенклатура.Цвет, Выборка_Номенклатура.Размер, ШтукВКоробке, НомерКоробки, НомерКоробки, ВсегоКоробок, Выборка_КА.КодАгрегации, МассивКМ)
				);
				
				Если ВыведеноЭтикетокПоНом % РазмерПорции = 0 ИЛИ ВыведеноЭтикетокПоНом = ВсегоКМпоНом ИЛИ (МаксЧислоЭтикеток > 0 И ВыведеноЭтикетокВсего >= МаксЧислоЭтикеток) Тогда
					НомерПорции	= НомерПорции + 1;
					
					ТекстКоробок = СтрШаблон("%1-%2", (НомерКоробки - ДанныеКоробок.Количество() + 1), НомерКоробки); 
					ТекстСообщения = СтрШаблон("Формирование этикеток по ном.: '%1'. Порция: %2. Коробки: %3 из %4", 
						Выборка_Номенклатура.Номенклатура, НомерПорции, ТекстКоробок, ВсегоКоробок);
					ДлительныеОперации.СообщитьПрогресс(Формат(100*ВыведеноЭтикетокВсего/ВсегоЭтикеток, "ЧДЦ=2"), ТекстСообщения);
					
					//Сообщить(ТекстСообщения);
															
					ИмяФайла	= КаталогВыгрузкиНом + ПолучитьРазделительПути() + "part_" + Формат(НомерПорции, "ЧЦ=5; ЧВН=; ЧГ=")+".pdf";					
					пВывода		= Новый Структура("МакетЭтикетки,МакетКА,ДанныеКоробок,ИмяФайла,ДопПараметры,фВыводитьЛогистическуюУпаковку,фДублироватьЭтикетки,фДублироватьКоробныеКоды",
						Макеты.МакетЭтикетки, Макеты.МакетКА, ДанныеКоробок, ИмяФайла, ДопПараметры, фВыводитьЛогистическуюУпаковку, фДублироватьЭтикетки, фДублироватьКоробныеКоды);

					Если Истина Тогда
						пФункции = Новый Массив;
						пФункции.Добавить(пВывода);
						
						АктивныеФЗ	= ОжидатьОсвобожденияОчередиЗадач(АктивныеФЗ, МаксЧислоФЗ);
						
						рЗапуска = инт_ДлительныеОперации.ВыполнитьВФоне(ЭтотОбъект.Метаданные().ПолноеИмя() + ".ВывестиЭтикеткиВФайл", пФункции, пВыполненияВФоне);
						АктивныеФЗ.Добавить(ФоновыеЗадания.НайтиПоУникальномуИдентификатору(рЗапуска.ИдентификаторЗадания));					
						
						МаркировкаКС.Состояние_("Активных заданий выгрузки: " + АктивныеФЗ.Количество());
					Иначе
						ВывестиЭтикеткиВФайл(пВывода);
					КонецЕсли;					
					
					ДанныеКоробок.Очистить();
				КонецЕсли;
				
				//Прервать;
				Если (МаксЧислоЭтикеток > 0 И ВыведеноЭтикетокВсего >= МаксЧислоЭтикеток) Тогда Прервать КонецЕсли;
				Если фПоОднойКоробке Тогда Прервать КонецЕсли;
			КонецЦикла;
			
			СоздатьФайлИнфо(КаталогВыгрузкиНом, Выборка_Номенклатура, НомерКоробки, ВыведеноЭтикетокПоНом, КоробокВФайле);			
		КонецЕсли;			
		Если (МаксЧислоЭтикеток > 0 И ВыведеноЭтикетокВсего >= МаксЧислоЭтикеток) Тогда Прервать КонецЕсли;
	КонецЦикла;
	
	МаркировкаКС.Состояние_("Ожидание окончания заданий выгрузки....");
	
	ОжидатьОсвобожденияОчередиЗадач(АктивныеФЗ);	
	
	МаркировкаКС.Состояние_("");
	
	Результат.Успешно = Истина;
	Результат.ОбработаноОбъектов = ВыведеноЭтикетокВсего;
	
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда		
		Результат.Успешно = Истина;
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);
		рВрем = ПолучитьИзВременногоХранилища(АдресВозврата);		
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПакетнаяПечатьЭтикетокЧЗ(пОбработки, АдресВозврата = Неопределено) Экспорт

Функция ВыгрузитьШаблоныМакетов(Макеты, ИмяМакета, КаталогВыгрузкиНом, пОбработки)
	ДанныеМакета = Макеты.МакетЭтикетки;
	МакетЭтикетки = ДанныеМакета.Область;
	УстановитьПараметрыОбласти(МакетЭтикетки, ДанныеМакета.Параметры);
	
	СтрокаКМ = "0108000000983206215!%)-annZMk:j";
	//ОбработкаПечатиЭтикеток.ВывестиШК(МакетЭтикетки, "ШК_ДатаМатрикс", ОбработкаПечатиЭтикеток.СформироватьКартинкуШК_DataMatrix(СтрокаКМ));	
	
	ТД = СоздатьТДЭтикеток(ИмяМакета);
	ТД.Вывести(МакетЭтикетки);
	
	ТД.Записать(КаталогВыгрузкиНом + "\МакетЭтикетки.pdf", ТипФайлаТабличногоДокумента.PDF_A_1);
	//Макеты.МакетКА.Область.Записать(КаталогВыгрузкиНом + "\МакетКА.pdf", ТипФайлаТабличногоДокумента.PDF_A_1);
КонецФункции //ВыгрузитьШаблоныМакетов(Макеты, ИмяМакета, КаталогВыгрузкиНом, пОбработки)

Функция СоздатьФайлИнфо(КаталогВыгрузкиНом, Выборка_Номенклатура, ВсегоКоробок, ВыведеноЭтикетокПоНом, КоробокВФайле)
	Данные = Новый Структура("ВсегоКоробок,ВсегоЭтикеток,КоробокВФайле", ВсегоКоробок, ВыведеноЭтикетокПоНом, КоробокВФайле);	
	
	Номенклатура = Новый Структура;
	Номенклатура.Вставить("НаименованиеGS1", 	Выборка_Номенклатура.Номенклатура_НаименованиеGS1);
	Номенклатура.Вставить("Наименование", 		Выборка_Номенклатура.Номенклатура_Наименование);
	Номенклатура.Вставить("Код", 				Выборка_Номенклатура.Номенклатура_Код);
	
	Данные.Вставить("Номенклатура", Номенклатура);
	
	ПолучитьДвоичныеДанныеИзСтроки(МаркировкаКС.ЗаписатьЖСОН(Данные)).Записать(КаталогВыгрузкиНом+"\info.json");
КонецФункции //СоздатьФайлИнфо(КаталогВыгрузкиНом, ВсегоКоробок, ВыведеноЭтикетокПоНом, КоробокВФайле)

Функция ПолучитьНоменклатуруДокумента(ВыбДок)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура ИЗ " + ВыбДок.Метаданные().ПолноеИмя() + ".Товары ГДЕ Ссылка = &ВыбДок И Количество>0";
	Запрос.УстановитьПараметр("ВыбДок", ВыбДок);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
КонецФункции //ПолучитьНоменклатуруДокумента(ВыбДок)

Функция ОжидатьОсвобожденияОчередиЗадач(АктивныеФЗ, Знач МаксЧислоФЗ = 0)
	Если МаксЧислоФЗ > 0 Тогда
		МаксЧислоФЗ = МаксЧислоФЗ - 1;
	КонецЕсли;	
	
	Пока АктивныеФЗ.Количество() > МаксЧислоФЗ Цикл
		рПроверки 	= ФоновыеЗадания.ОжидатьЗавершенияВыполнения(АктивныеФЗ);
		АктивныеФЗ	= Новый Массив;
		Для Каждого ФЗ Из рПроверки Цикл
			Если ФЗ.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				АктивныеФЗ.Добавить(ФЗ);
			КонецЕсли;				
		КонецЦикла;
	КонецЦикла;	  
	
	Возврат АктивныеФЗ;
КонецФункции //ОжидатьОсвобожденияОчередиЗадач(АктивныеФЗ, МаксЧислоФЗ)

Функция ВывестиЭтикеткиВФайл(пОбработки, АдресВозврата = Неопределено) Экспорт	
	ДанныеКоробок	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ДанныеКоробок");
	ИмяФайла		= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ИмяФайла");
	ДопПараметры	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ДопПараметры");
	
	сМакетЭтикетки	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "МакетЭтикетки");
	сМакетКА		= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "МакетКА");
	
	МакетЭтикетки = сМакетЭтикетки.Область;
	УстановитьПараметрыОбласти(МакетЭтикетки, сМакетЭтикетки.Параметры);
	
	МакетКА = сМакетКА.Область;
	УстановитьПараметрыОбласти(МакетКА, сМакетКА.Параметры);
	
	фВыводитьЛогистическуюУпаковку	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "фВыводитьЛогистическуюУпаковку", 	Ложь);
	фДублироватьЭтикетки			= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "фДублироватьЭтикетки", 			Ложь);
	фДублироватьКоробныеКоды		= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "фДублироватьКоробныеКоды", 		Ложь);	
	
	Адрес = ПоместитьВоВременноеХранилище(МакетЭтикетки);
	МакетЭтикетки = ПолучитьИзВременногоХранилища(Адрес);
	
	// Смирнов М.Ю. 01.08.2025 HELP-6117 начало 
	Если пОбработки.Свойство("ДопПараметры") И пОбработки.ДопПараметры.Свойство("ИмяМакета") Тогда
		ТД = СоздатьТДЭтикеток(пОбработки.ДопПараметры.ИмяМакета); 
	Иначе
		ТД = СоздатьТДЭтикеток();
	КонецЕсли;
	// Смирнов М.Ю. 01.08.2025 HELP-6117 конец
	//[НомерКоробки]/[ВсегоКоробок] Pcs [НомерШтуки]/[ШтукВКоробке]"	
	
	Для Каждого ДанныеКоробки Из ДанныеКоробок Цикл		
		ДопПараметры.Вставить("НомерКоробки", ДанныеКоробки.НомерКоробки);		
		ДопПараметры.Вставить("ВсегоКоробок", ДанныеКоробки.ВсегоКоробок);
		ДопПараметры.Вставить("ШтукВКоробке", ДанныеКоробки.ШтукВКоробке);
		
		НомерШтуки = 0;
		Для каждого ДанныеКМ Из ДанныеКоробки.МассивКМ Цикл			
			НомерШтуки = НомерШтуки + 1;
			ДопПараметры.Вставить("НомерШтуки", НомерШтуки);
			
			Этикетка = СформироватьЭтикету(МакетЭтикетки, ДанныеКМ, ДопПараметры);			
			
			ТД.Вывести(Этикетка);					
			ТД.ВывестиГоризонтальныйРазделительСтраниц();
			
			Если фДублироватьЭтикетки Тогда              
				ТД.Вывести(Этикетка);					
				ТД.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла;	
		
		КодАгрегации 	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеКоробки, "КодАгрегации", "");
		НомерКоробки	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеКоробки, "НомерКоробки", 0);
		КоличествоШтук	= НомерШтуки;
		Если ЗначениеЗаполнено(ДанныеКоробки.КодАгрегации) И фВыводитьЛогистическуюУпаковку Тогда					
			КА = СформироватьКА(МакетКА, КодАгрегации, НомерКоробки, КоличествоШтук, ДанныеКоробки, пОбработки);				
		
			ВременныйТаблДок = Новый ТабличныйДокумент;
   			ОбластьЯчеек = ВременныйТаблДок.Вывести(КА);   				
   			ОбластьЯчеек.СоздатьФорматСтрок();    				
		
			ТД.Вывести(ВременныйТаблДок);
			
			Если фДублироватьКоробныеКоды Тогда
				ТД.ВывестиГоризонтальныйРазделительСтраниц();
				ТД.Вывести(ВременныйТаблДок);							
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	ТипФайла = ?(СтрЗаканчиваетсяНа(ВРег(ИмяФайла), "MXL"), ТипФайлаТабличногоДокумента.MXL, ТипФайлаТабличногоДокумента.PDF_A_1);
	ТД.Записать(ИмяФайла, ТипФайла);	
	
	Возврат ТД;
КонецФункции //ВывестиЭтикеткиВФайл(пОбработки, АдресВозврата = Неопределено) Экспорт

Функция СоздатьТДЭтикеток(ИмяМакета = "")
	
	// Смирнов М.Ю. 01.08.2025 HELP-6117 начало
	//Функция СоздатьТДЭтикеток(ИмяМакета = "")
	ТД = Новый ТабличныйДокумент;		
	//ТД.ИмяПараметровПечати = "ПараметрыПечати_ПечатьЭтикетки_"	+ ИмяМакета;	
	
	Если ИмяМакета = "" Или ИмяМакета = "МакетИнформацияУпаковкаСтикерХлопок70на70Китай"
		// Кельманов А.В. - MARK-2823 - 2025.12.02 {
		Или ИмяМакета = "МакетЧЗИнформацияСтикерОбщаяЧНИспайки" 
		// Кельманов А.В. - MARK-2823 - 2025.12.02 }
		Или ИмяМакета = "МакетИнформацияУпаковкаСтикерСинтетикаЧНИ70на70Китай" 
		Или ИмяМакета = "МакетИнформацияТестУпаковкаСтикерКолготкиДетскиеКитай" Тогда
		ТД.ВысотаСтраницы = 70;
		ТД.ШиринаСтраницы = 70;
	ИначеЕсли ИмяМакета = "МакетИнформацияУпаковкаОбщаяЧЗ" Тогда
		ТД.ВысотаСтраницы = 50;
		ТД.ШиринаСтраницы = 92;
	ИначеЕсли ИмяМакета = "МакетинформацияТестУпаковкаСтикерНоскиГольфыДетство" Тогда
		ТД.ВысотаСтраницы = 82;
		ТД.ШиринаСтраницы = 62;
	// Кельманов А.В. - MARK-2823 - 2025.12.02 {
	ИначеЕсли ИмяМакета = "МакетЧЗИнформацияСтикерОбщаяБельеСпайки" Тогда
		ТД.ВысотаСтраницы = 50;
		ТД.ШиринаСтраницы = 86;
	// Кельманов А.В. - MARK-2823 - 2025.12.02 }
	Иначе
	КонецЕсли;
	// Смирнов М.Ю. 01.08.2025 HELP-6117 конец
	
	ТД.ПолеСверху = 0.0;
	ТД.ПолеСнизу = 0.0;
	ТД.ПолеСлева = 0.0;
	ТД.ПолеСправа = 0.0;
	
	ТД.ОтображатьСетку = Ложь;
	ТД.ОтображатьЗаголовки = Ложь;	

	Возврат ТД;
КонецФункции // () 

Функция ОпределитьРазмерПорции(ШтукВКоробке, Знач РазмерПорции = 400)
	КоробокВФайле = 1;
	Если ШтукВКоробке <= 50 Тогда
		КоробокВФайле = 10;
	ИначеЕсли ШтукВКоробке <= 75 Тогда
		КоробокВФайле = 5;
	ИначеЕсли ШтукВКоробке <= 100 Тогда
		КоробокВФайле = 4;
	ИначеЕсли ШтукВКоробке < 250 Тогда
		КоробокВФайле = 2;
	КонецЕсли;
	Возврат ШтукВКоробке*КоробокВФайле;
	
	КоробокВПории = Цел(РазмерПорции/ШтукВКоробке);
	Превышение = (КоробокВПории+1)*ШтукВКоробке-РазмерПорции;
	Если Превышение/РазмерПорции<0.3 Тогда
		КоробокВПории 	= КоробокВПории+1;		
	КонецЕсли;                            
	РазмерПорции	= КоробокВПории*ШтукВКоробке;
	
	Возврат РазмерПорции;
КонецФункции //ОпределитьРазмерПорции(ШтукВКоробке, Знач РазмерПорции = 400)

Функция ПроверитьСоздатьКаталогФайлов(ИмяКаталога)
	Файл = Новый Файл(ИмяКаталога);
	Если НЕ Файл.Существует() Тогда
		СоздатьКаталог(ИмяКаталога);			
	КонецЕсли;
КонецФункции //ПроверитьСоздатьКаталогФайлов(ИмяКаталога)

Функция ПолучитьВыборкуКодов(ЗПС_Ссылка, МаксЧислоЭтикеток = 0)
	Запрос = Новый Запрос;
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	ДокументОснование 	КАК ЗПС,
	|	Ссылка 				КАК Эмиссия
	|ПОМЕСТИТЬ ВТ_Эмиссии
	|ИЗ
	|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|ГДЕ
	|	ДокументОснование = &ЗПС_Ссылка
	|;
	|ВЫБРАТЬ " + ?(МаксЧислоЭтикеток=0, "", "ПЕРВЫЕ " + МаркировкаКС.ЧислоБезДури(МаксЧислоЭтикеток)) + "
	|	ЕСТЬNULL(КодыАгрегации.КодАгрегации, ""9999"") 	КАК КодАгрегации,
	|	ШК_ЧЗ.Владелец.Родитель 						КАК Модель,
	|	ШК_ЧЗ.Владелец.Родитель.ШтукВКоробке			КАК ШтукВКоробке,
	|	ШК_ЧЗ.Владелец.Родитель.КодПроизводителя		КАК Артикул,
	|	ШК_ЧЗ.Владелец.Цвет								КАК Цвет,
	|	ШК_ЧЗ.Владелец.Размер							КАК Размер,
	|	ШК_ЧЗ.Владелец 									КАК Номенклатура,
	|	ШК_ЧЗ.Владелец.Наименование						КАК Номенклатура_Наименование,
	|	ШК_ЧЗ.Владелец.НаименованиеGS1					КАК Номенклатура_НаименованиеGS1,
	|	ШК_ЧЗ.Владелец.Код								КАК Номенклатура_Код,
	|	ШК_ЧЗ.Владелец.ГТИН								КАК Номенклатура_ГТИН,
	|	ШК_ЧЗ.Ссылка									КАК КМ,
	|	ШК_ЧЗ.Ссылка.Наименование						КАК СГТИН,
	|	ШК_ЧЗ.ЗначениеШтрихкода							КАК ЗначениеКМ
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШК_ЧЗ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТ_Эмиссии КАК ВТ_Эмиссии
	|ПО 
	|	ШК_ЧЗ.ЗаказКМ = ВТ_Эмиссии.Эмиссия
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Документ.ЗаказПоставщику.Товары КАК ТЧ_Товары
	|ПО
	|	ТЧ_Товары.Ссылка = &ЗПС_Ссылка
	|	И ТЧ_Товары.Номенклатура = ШК_ЧЗ.Владелец	
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК КодыАгрегации
	|ПО 
	|	ШК_ЧЗ.Ссылка = КодыАгрегации.ШтрихкодУпаковки
	|	И (КодыАгрегации.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация))
	|	И (КодыАгрегации.Ссылка.ДокументОснование = &ЗПС_Ссылка)	
	|УПОРЯДОЧИТЬ ПО
	|	КодАгрегации,
	|	ШК_ЧЗ.Владелец,
	|	ШК_ЧЗ.Наименование
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КМ)
	|ПО
	|	Номенклатура,
	|	КодАгрегации
	|";
	
	// Смирнов М.Ю. 28.07.2025 HELP-6117 начало
	Если ТипЗнч(ЗПС_Ссылка) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ЗаказПоставщику.", СтрШаблон(".%1.", ЗПС_Ссылка.Метаданные().Имя));
	КонецЕсли;
	// Смирнов М.Ю. 28.07.2025 HELP-6117 конец

	Запрос.УстановитьПараметр("ЗПС_Ссылка", ЗПС_Ссылка);	
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
КонецФункции // ()

Функция СформироватьИмяПапкиНоменклатуры(НаименованиеGS1, Наименование, Код)
	Результат = ?(ПустаяСтрока(НаименованиеGS1), Наименование, НаименованиеGS1); 
	Результат = СтрЗаменить(Результат, "\", "_");
	Результат = СтрЗаменить(Результат, "/", "_");
	Результат = СтрЗаменить(Результат, ".", "_");
	Результат = СтрЗаменить(Результат, ",", "_");
	Результат = СтрЗаменить(Результат, """", "");
								
	Возврат СокрЛП(Результат) + "_" + Код;
КонецФункции // ()

//Шиза из-за отсутствия сериализации параметров области
Функция УстановитьПараметрыОбласти(Область, мПараметры)
	Для Сч = 0 По мПараметры.ВГраница() Цикл
		Область.Параметры.Установить(Сч, мПараметры[Сч]);	
	КонецЦикла;
КонецФункции //УстановитьПараметрыОбласти(Область, мПараметры)


#КонецОбласти

ОбработкаПечатиЭтикеток = Обработки.ФормированиеМакетовЭтикеток.Создать();
